In [1]:
import pandas as pd
import os
import opendatasets as od
import zipfile

In [2]:
od.download('https://www.kaggle.com/datasets/vinicius150987/titanic3')

Please provide your Kaggle credentials to download this dataset. Learn more: http://bit.ly/kaggle-creds
Your Kaggle username:

  dwa

Your Kaggle Key:

  ········

Dataset URL: https://www.kaggle.com/datasets/vinicius150987/titanic3
Downloading titanic3.zip to .\titanic3

100%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 277k/277k [00:00<00:00, 529kB/s]

In [3]:
#Cria as pastas necessarias
if os.path.exists('titanic3'):
    os.rename("titanic3", "raw")
if not os.path.exists('staging'):
    os.makedirs('staging')
if not os.path.exists('refined'):
    os.makedirs('refined')

In [4]:
# Lê o arquivo e cria o DataFrame
titanic = pd.read_excel('./raw/titanic3.xls')

In [5]:
# Renomeando/traduzindo as colunas
titanic = titanic.rename(columns={'age': 'idade',
                                 'pclass':'classe',
                                 'survived':'sobrevivente',
                                 'name':'nome',
                                 'sex':'sexo',
                                 'ticket':'bilhete',
                                 'fare':'tarifa',
                                 'embarked':'embarcado',
                                 'boat':'bote',
                                 'body':'corpo',
                                 'home.dest':'destino',
                                  'sibsp':'parente_2',
                                  'parch':'parente_1',
                                  'cabin':'cabine'
                                 })

In [6]:
titanic.head()

,classe,sobrevivente,nome,sexo,idade,parente_2,parente_1,bilhete,tarifa,cabine,embarcado,bote,corpo,destino
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [7]:
titanic.to_csv('./staging/titanic.csv', index=False)